In [1]:
import pandas as pd
import numpy as np
import datetime
import nltk
from nltk import word_tokenize

In [2]:
# Definindo o caminho dos dados
data_company_path = "dados/Company.csv"
data_tweet_path = "dados/Tweet.csv"
data_company_tweet_path = "dados/Company_Tweet.csv"

In [3]:
# Ler e colocar em um dataframe
data_company = pd.read_csv(data_company_path)
data_tweet = pd.read_csv(data_tweet_path)
data_company_tweet = pd.read_csv(data_company_tweet_path)

In [4]:
print(data_company_tweet.head())
print(data_company_tweet.shape)

             tweet_id ticker_symbol
0  550803612197457920          AAPL
1  550803610825928706          AAPL
2  550803225113157632          AAPL
3  550802957370159104          AAPL
4  550802855129382912          AAPL
(4336445, 2)

In [5]:
print(data_company)
print(data_company.shape)

  ticker_symbol company_name
0          AAPL        apple
1          GOOG   Google Inc
2         GOOGL   Google Inc
3          AMZN   Amazon.com
4          TSLA    Tesla Inc
5          MSFT    Microsoft
(6, 2)

In [6]:
print(data_tweet.head())
print(data_tweet.shape)

             tweet_id           writer   post_date  \
0  550441509175443456  VisualStockRSRC  1420070457
1  550441672312512512      KeralaGuy77  1420070496
2  550441732014223360      DozenStocks  1420070510
3  550442977802207232     ShowDreamCar  1420070807
4  550443807834402816     i_Know_First  1420071005

                                                body  comment_num  \
0  lx21 made $10,008  on $AAPL -Check it out! htt...            0
1  Insanity of today weirdo massive selling. $aap...            0
2  S&P100 #Stocks Performance $HD $LOW $SBUX $TGT...            0
3  $GM $TSLA: Volkswagen Pushes 2014 Record Recal...            0
4  Swing Trading: Up To 8.91% Return In 14 Days h...            0

   retweet_num  like_num
0            0         1
1            0         0
2            0         0
3            0         1
4            0         1
(3717964, 7)

In [7]:
dados_merge1 = pd.merge(data_company_tweet,data_company, on='ticker_symbol')
dados_merge1 = dados_merge1.drop(columns=['ticker_symbol'])
dados_merge1.head()

             tweet_id company_name
0  550803612197457920        apple
1  550803610825928706        apple
2  550803225113157632        apple
3  550802957370159104        apple
4  550802855129382912        apple

In [8]:
dados_tweet_company = pd.merge(dados_merge1,data_tweet,on='tweet_id')
dados_tweet_company = dados_tweet_company.drop(columns=['tweet_id'])
dados_tweet_company.head()

,company_name,writer,post_date,body,comment_num,retweet_num,like_num
0,apple,SentiQuant,1420156789,#TOPTICKERTWEETS $AAPL $IMRS $BABA $EBAY $AMZN...,0,0,1
1,Amazon.com,SentiQuant,1420156789,#TOPTICKERTWEETS $AAPL $IMRS $BABA $EBAY $AMZN...,0,0,1
2,apple,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1
3,Google Inc,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1
4,Amazon.com,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1

## Ajustar os Dados

In [9]:
dados_tweet_company.post_date[0]

1420156789

In [10]:
ts_epoch = dados_tweet_company.post_date[0]
ts = datetime.datetime.fromtimestamp(ts_epoch).strftime('%Y-%m-%d %H:%M:%S')
ts

'2015-01-01 20:59:49'

In [14]:
def ajustar_tempo(row):
    ts_epoch = row['post_date']
    ts = datetime.datetime.fromtimestamp(ts_epoch).strftime('%Y-%m-%d %H:%M:%S')
    return ts  
new_date = dados_tweet_company.apply(ajustar_tempo,axis=1)
dados_tweet_company['Date'] = list(new_date)
dados_tweet_company.head()

,company_name,writer,post_date,body,comment_num,retweet_num,like_num,Date
0,apple,SentiQuant,1420156789,#TOPTICKERTWEETS $AAPL $IMRS $BABA $EBAY $AMZN...,0,0,1,2015-01-01 20:59:49
1,Amazon.com,SentiQuant,1420156789,#TOPTICKERTWEETS $AAPL $IMRS $BABA $EBAY $AMZN...,0,0,1,2015-01-01 20:59:49
2,apple,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1,2015-01-01 20:59:48
3,Google Inc,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1,2015-01-01 20:59:48
4,Amazon.com,SentiQuant,1420156788,#SENTISHIFTUP $K $FB $GOOGL $GS $GOLD $T $AAPL...,0,0,1,2015-01-01 20:59:48

In [26]:
dados_tweet_company.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4336445 entries, 0 to 4336444
Data columns (total 8 columns):
company_name    object
writer          object
post_date       int64
body            object
comment_num     int64
retweet_num     int64
like_num        int64
Date            object
dtypes: int64(4), object(4)
memory usage: 297.8+ MB

In [33]:
# função para das um score ao tweet usando num de likes , comentarios e retweets
def score():
    score = 0
    return score

# função para criar labels de sentimento a partir do score
def label():
    # 0 neutro | 1 positivo | -1 negative
    label = 0
    return label

0      3744054
1       392542
2        98735
3        37450
4        18658
5        11164
6         7299
7         5185
8         3695
9         2774
10        2137
11        1738
12        1423
13        1212
14         973
15         864
16         673
17         611
18         521
19         451
20         375
22         344
21         335
23         259
25         226
24         221
26         184
27         162
28         162
30         126
        ...
112          1
75           1
120          1
122          1
123          1
125          1
126          1
128          1
131          1
133          1
134          1
135          1
142          1
144          1
194          1
147          1
148          1
149          1
151          1
154          1
157          1
160          1
163          1
164          1
165          1
167          1
168          1
184          1
193          1
631          1
Name: comment_num, Length: 191, dtype: int64

In [17]:
#def post_tokenizer(row)
#    new_post = word_tokenize(row['body'])
#    return new_post
#dados_tweet_company['post_tokenized'] = list(dados_tweet_company.apply(post_tokenizer))

In [18]:
#def remove_stopwords(row):
#    stopwords = nltk.corpus.stopwords.words('english')
#    output = [word for word in row['post_tokenized'][0] if word not in stopwords]
#    return output
#dados_tweet_company['post_removed_stopwords'] = list(dados_tweet_company.apply(remove_stopwords))